<?php
   // калькулятор депозиту за допомогою циклу for 
    function deposit($suma, $period) {
        $stavka = $period > 5 ? 8 : 5; // якщо термін вкладу більший, ніж 5 років - відсоткова ставка 8, якщо менший - 5
        for ($i = 1; $i <= $period; $i++) {
            $profit = round($suma * $stavka / 100, 2); // заокруглюємо число до двох символів після крапки
            $suma += $profit;
            echo "Після $i-го року в банку ваш вклад буде становити $suma гривень".'<br>';
        }
    }

    
    deposit(100000, 10);


?>