<?php
    // виводимо з масиву назву району по першій літері
    $region = [
        'Вінницька область' => ['Вінницький', 'Гайсинський', 'Жмеринський', 'Могилів-Подільський', 'Тульчинський', 'Хмільницький' ],
        'Волинська область' => ['Володимир-Волинський', 'Камінь-Каширський', 'Ковельський', 'Луцький'],
        'Рівненська область' => ['Вараський', 'Дубенський', 'Рівненський', 'Сарненський'],
        'Тернопільська область' => ['Кременецький', 'Тернопільський', 'Чортківський', 'Бережанський']      
    ];
        foreach ($region as $oblast => $district) {
                foreach ($district as $rayon) {
                    if(mb_substr($rayon, 0, 1) == 'В') { // за допомогою функції перевіряємо на відповідність символ з позицією 0
                        echo $rayon . '<br>';
                    } 
                }
        }



?>